title: Domain Logon Followed By Suspicious Process Activity
id: f91ca4c9-2f1a-4c6b-92c8-det0210-an0590-4
status: experimental
description: Detects suspicious Sysmon process activity shortly after a domain logon event.
author: NullSpecter
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventID: 1
  condition: selection
fields:
  - User
  - ParentImage
  - Image
  - CommandLine
falsepositives:
  - Legitimate admin activity
level: medium
